app/Controllers/Blog.php

    public function update($id)
    {
        $user = new UserModel();
        $data['user'] = $user->find($id);
---
SELECT *
FROM `user`
WHERE `user`.`deleted_at` IS NULL
AND `user`.`id` = '93'

    public function login_validate()
    {
        $user = new UserModel();
        $email = $this->request->getVar('email');
        $password = $this->request->getVar('password');

        $remember = $this->request->getVar('remember_me');

        $data = $user->where('email', $email)->first();
---
SELECT *
FROM `user`
WHERE `email` = 'admin@gmail.com'
AND `user`.`deleted_at` IS NULL
 LIMIT 1