app/Models/UserModel.php

SELECT *
FROM `user`
WHERE `user`.`deleted_at` IS NULL
---
    public function getUser()
    {
        return $this->findAll();